File: weights.loss.276-277377.218750-0.832617.h5

Model: "your_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 30, 40, 3)]  0                                            
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 30, 40, 3)    12          input_1[0][0]                    
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 30, 40, 8)    216         batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 30, 40, 8)    24          conv2d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, 30, 40, 8)    0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
dropout (Dropout)               (None, 30, 40, 8)    0           activation[0][0]                 
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 30, 40, 10)   720         dropout[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 15, 20, 5)    360         dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 30, 40, 10)   30          conv2d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 15, 20, 5)    15          conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 30, 40, 10)   0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 15, 20, 5)    0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 15, 20, 10)   0           activation_2[0][0]               
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 15, 20, 15)   0           activation_1[0][0]               
                                                                 average_pooling2d[0][0]          
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 15, 20, 15)   0           concatenate[0][0]                
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 15, 20, 12)   1620        dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 8, 10, 6)     810         dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 15, 20, 12)   36          conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 8, 10, 6)     18          conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 15, 20, 12)   0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 8, 10, 6)     0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 8, 10, 12)    0           activation_4[0][0]               
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 8, 10, 18)    0           activation_3[0][0]               
                                                                 average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 8, 10, 18)    0           concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 8, 10, 12)    1944        dropout_2[0][0]                  
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 4, 5, 6)      972         dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 8, 10, 12)    36          conv2d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 4, 5, 6)      18          conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 8, 10, 12)    0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 4, 5, 6)      0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 4, 5, 12)     0           activation_6[0][0]               
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 4, 5, 18)     0           activation_5[0][0]               
                                                                 average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 4, 5, 18)     0           concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 4, 5, 14)     2268        dropout_3[0][0]                  
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 2, 3, 7)      1134        dropout_3[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 4, 5, 14)     42          conv2d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 2, 3, 7)      21          conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 4, 5, 14)     0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 2, 3, 7)      0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
average_pooling2d_3 (AveragePoo (None, 2, 3, 14)     0           activation_8[0][0]               
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 2, 3, 21)     0           activation_7[0][0]               
                                                                 average_pooling2d_3[0][0]        
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 2, 3, 21)     0           concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 2, 3, 40)     7560        dropout_4[0][0]                  
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 2, 3, 40)     120         conv2d_9[0][0]                   
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 2, 3, 40)     0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 40)           0           activation_9[0][0]               
__________________________________________________________________________________________________
dense (Dense)                   (None, 40)           1640        global_average_pooling2d[0][0]   
==================================================================================================
Total params: 19,616
Trainable params: 19,370
Non-trainable params: 246
__________________________________________________________________________________________________
